# Preprocess

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('schema&question&answer.csv')

In [3]:
df.head()

,field1,field2,field3,field4,field5,field6,field7,field1.1,field2.1,field1.2,field2.2,field3.1,field4.1,field5.1
0,1409,SELECT SUM(first_name)\r\nFROM person \r\nWHER...,2018-08-22 09:03:34.219155+10,1,0,240,noninterpretable,1,"Person(id, first_name, last_name, year_born) p...",1,SQL Exercise 1,Consider the given relational database moviedb...,2,SELECT count(*) \r\nFROM person p \r\nWHERE EX...
1,53,SELECT COUNT(*) FROM (SELECT DISTINCT person.i...,2018-08-10 12:31:49.231881+10,1,1,12,correct,1,"Person(id, first_name, last_name, year_born) p...",1,SQL Exercise 1,Consider the given relational database moviedb...,2,SELECT count(*) \r\nFROM person p \r\nWHERE EX...
2,54,SELECT COUNT(*) FROM (SELECT DISTINCT person.i...,2018-08-10 12:32:19.970559+10,1,1,12,correct,1,"Person(id, first_name, last_name, year_born) p...",1,SQL Exercise 1,Consider the given relational database moviedb...,2,SELECT count(*) \r\nFROM person p \r\nWHERE EX...
3,55,SELECT COUNT(*) FROM (SELECT person.id FROM pe...,2018-08-10 12:35:12.280294+10,1,0,12,partially correct,1,"Person(id, first_name, last_name, year_born) p...",1,SQL Exercise 1,Consider the given relational database moviedb...,2,SELECT count(*) \r\nFROM person p \r\nWHERE EX...
4,56,"SELECT production_year, COUNT(*) FROM movie \r...",2018-08-10 12:48:24.607193+10,2,1,12,correct,2,"Movie(title, production_year, country, run_tim...",2,SQL Exercise 2,Consider the given relational database moviedb...,1,"SELECT production_year, count(*) \r\nFROM movi..."

In [4]:
len(df['field2.1'][8000])

525

In [5]:
df['field2.1'][8000]

'Writer Award(id, title, production_year, award_name, year_of_award, category, result) primary key : {id, title, production_year, award_name, year_of_award, category} foreign keys : [id, title, production_year] _ Writer[id, title, production_year], [award_name] _ Award[award_name];\nWriter(id, title, production_year, credits) primary key : {id, title, production_year} foreign keys : [title, production_year] _ Movie[title, production_year], [id] _ Person[id];\nPerson(id, first_name, last_name, year born) primary key : {id};'

In [6]:
df = df.drop(['field1', 'field3', 'field4', 'field6', 'field7', 'field1.1', 'field1.2', 'field2.2', 'field4.1', 'field5.1'], axis=1)

In [7]:
df.head()

,field2,field5,field2.1,field3.1
0,SELECT SUM(first_name)\r\nFROM person \r\nWHER...,0,"Person(id, first_name, last_name, year_born) p...",Consider the given relational database moviedb...
1,SELECT COUNT(*) FROM (SELECT DISTINCT person.i...,1,"Person(id, first_name, last_name, year_born) p...",Consider the given relational database moviedb...
2,SELECT COUNT(*) FROM (SELECT DISTINCT person.i...,1,"Person(id, first_name, last_name, year_born) p...",Consider the given relational database moviedb...
3,SELECT COUNT(*) FROM (SELECT person.id FROM pe...,0,"Person(id, first_name, last_name, year_born) p...",Consider the given relational database moviedb...
4,"SELECT production_year, COUNT(*) FROM movie \r...",1,"Movie(title, production_year, country, run_tim...",Consider the given relational database moviedb...

In [8]:
import re

# Function to clean text
def clean_text(text):
    start_pos = re.search('Question:', text).start()
    return text[start_pos:]

# Apply the cleaning function to all rows in the 'preamble' column
df['questions'] = df['field3.1'].apply(clean_text)

In [9]:
df.head()

,field2,field5,field2.1,field3.1,questions
0,SELECT SUM(first_name)\r\nFROM person \r\nWHER...,0,"Person(id, first_name, last_name, year_born) p...",Consider the given relational database moviedb...,Question: How many writers were born in 1935?
1,SELECT COUNT(*) FROM (SELECT DISTINCT person.i...,1,"Person(id, first_name, last_name, year_born) p...",Consider the given relational database moviedb...,Question: How many writers were born in 1935?
2,SELECT COUNT(*) FROM (SELECT DISTINCT person.i...,1,"Person(id, first_name, last_name, year_born) p...",Consider the given relational database moviedb...,Question: How many writers were born in 1935?
3,SELECT COUNT(*) FROM (SELECT person.id FROM pe...,0,"Person(id, first_name, last_name, year_born) p...",Consider the given relational database moviedb...,Question: How many writers were born in 1935?
4,"SELECT production_year, COUNT(*) FROM movie \r...",1,"Movie(title, production_year, country, run_tim...",Consider the given relational database moviedb...,Question: How many movies were produced in 199...

In [10]:
df = df.drop('field3.1', axis=1)

In [11]:
df.head()

,field2,field5,field2.1,questions
0,SELECT SUM(first_name)\r\nFROM person \r\nWHER...,0,"Person(id, first_name, last_name, year_born) p...",Question: How many writers were born in 1935?
1,SELECT COUNT(*) FROM (SELECT DISTINCT person.i...,1,"Person(id, first_name, last_name, year_born) p...",Question: How many writers were born in 1935?
2,SELECT COUNT(*) FROM (SELECT DISTINCT person.i...,1,"Person(id, first_name, last_name, year_born) p...",Question: How many writers were born in 1935?
3,SELECT COUNT(*) FROM (SELECT person.id FROM pe...,0,"Person(id, first_name, last_name, year_born) p...",Question: How many writers were born in 1935?
4,"SELECT production_year, COUNT(*) FROM movie \r...",1,"Movie(title, production_year, country, run_tim...",Question: How many movies were produced in 199...

In [12]:
# Function to add content to each row
def add_content(row):
    return "[Answer]: " + str(row)

# Apply the function to the 'cleaned_preamble' column
df['answer'] = df['field2'].apply(add_content)

In [13]:
df.head()

,field2,field5,field2.1,questions,answer
0,SELECT SUM(first_name)\r\nFROM person \r\nWHER...,0,"Person(id, first_name, last_name, year_born) p...",Question: How many writers were born in 1935?,[Answer]: SELECT SUM(first_name)\r\nFROM perso...
1,SELECT COUNT(*) FROM (SELECT DISTINCT person.i...,1,"Person(id, first_name, last_name, year_born) p...",Question: How many writers were born in 1935?,[Answer]: SELECT COUNT(*) FROM (SELECT DISTINC...
2,SELECT COUNT(*) FROM (SELECT DISTINCT person.i...,1,"Person(id, first_name, last_name, year_born) p...",Question: How many writers were born in 1935?,[Answer]: SELECT COUNT(*) FROM (SELECT DISTINC...
3,SELECT COUNT(*) FROM (SELECT person.id FROM pe...,0,"Person(id, first_name, last_name, year_born) p...",Question: How many writers were born in 1935?,[Answer]: SELECT COUNT(*) FROM (SELECT person....
4,"SELECT production_year, COUNT(*) FROM movie \r...",1,"Movie(title, production_year, country, run_tim...",Question: How many movies were produced in 199...,"[Answer]: SELECT production_year, COUNT(*) FRO..."

In [14]:
df = df.drop('field2', axis=1)

In [15]:
df.head()

,field5,field2.1,questions,answer
0,0,"Person(id, first_name, last_name, year_born) p...",Question: How many writers were born in 1935?,[Answer]: SELECT SUM(first_name)\r\nFROM perso...
1,1,"Person(id, first_name, last_name, year_born) p...",Question: How many writers were born in 1935?,[Answer]: SELECT COUNT(*) FROM (SELECT DISTINC...
2,1,"Person(id, first_name, last_name, year_born) p...",Question: How many writers were born in 1935?,[Answer]: SELECT COUNT(*) FROM (SELECT DISTINC...
3,0,"Person(id, first_name, last_name, year_born) p...",Question: How many writers were born in 1935?,[Answer]: SELECT COUNT(*) FROM (SELECT person....
4,1,"Movie(title, production_year, country, run_tim...",Question: How many movies were produced in 199...,"[Answer]: SELECT production_year, COUNT(*) FRO..."

In [16]:
# Function to add content to each row
def add_content(row):
    return "[Schema]: " + str(row)

# Apply the function to the 'cleaned_preamble' column
df['Schema'] = df['field2.1'].apply(add_content)

In [17]:
df = df.drop('field2.1', axis=1)

In [18]:
df.head()

,field5,questions,answer,Schema
0,0,Question: How many writers were born in 1935?,[Answer]: SELECT SUM(first_name)\r\nFROM perso...,"[Schema]: Person(id, first_name, last_name, ye..."
1,1,Question: How many writers were born in 1935?,[Answer]: SELECT COUNT(*) FROM (SELECT DISTINC...,"[Schema]: Person(id, first_name, last_name, ye..."
2,1,Question: How many writers were born in 1935?,[Answer]: SELECT COUNT(*) FROM (SELECT DISTINC...,"[Schema]: Person(id, first_name, last_name, ye..."
3,0,Question: How many writers were born in 1935?,[Answer]: SELECT COUNT(*) FROM (SELECT person....,"[Schema]: Person(id, first_name, last_name, ye..."
4,1,Question: How many movies were produced in 199...,"[Answer]: SELECT production_year, COUNT(*) FRO...","[Schema]: Movie(title, production_year, countr..."

In [19]:
# Function to add square brackets around "Question"
def add_brackets(row):
    return row.replace("Question", "[Question]")

# Apply the function to the 'cleaned_preamble' column
df['questions'] = df['questions'].apply(add_brackets)

In [20]:
df.head()

,field5,questions,answer,Schema
0,0,[Question]: How many writers were born in 1935?,[Answer]: SELECT SUM(first_name)\r\nFROM perso...,"[Schema]: Person(id, first_name, last_name, ye..."
1,1,[Question]: How many writers were born in 1935?,[Answer]: SELECT COUNT(*) FROM (SELECT DISTINC...,"[Schema]: Person(id, first_name, last_name, ye..."
2,1,[Question]: How many writers were born in 1935?,[Answer]: SELECT COUNT(*) FROM (SELECT DISTINC...,"[Schema]: Person(id, first_name, last_name, ye..."
3,0,[Question]: How many writers were born in 1935?,[Answer]: SELECT COUNT(*) FROM (SELECT person....,"[Schema]: Person(id, first_name, last_name, ye..."
4,1,[Question]: How many movies were produced in 1...,"[Answer]: SELECT production_year, COUNT(*) FRO...","[Schema]: Movie(title, production_year, countr..."

In [21]:
df = df.loc[:,['Schema', 'questions', 'answer', 'field5']]

In [22]:
df.head()

,Schema,questions,answer,field5
0,"[Schema]: Person(id, first_name, last_name, ye...",[Question]: How many writers were born in 1935?,[Answer]: SELECT SUM(first_name)\r\nFROM perso...,0
1,"[Schema]: Person(id, first_name, last_name, ye...",[Question]: How many writers were born in 1935?,[Answer]: SELECT COUNT(*) FROM (SELECT DISTINC...,1
2,"[Schema]: Person(id, first_name, last_name, ye...",[Question]: How many writers were born in 1935?,[Answer]: SELECT COUNT(*) FROM (SELECT DISTINC...,1
3,"[Schema]: Person(id, first_name, last_name, ye...",[Question]: How many writers were born in 1935?,[Answer]: SELECT COUNT(*) FROM (SELECT person....,0
4,"[Schema]: Movie(title, production_year, countr...",[Question]: How many movies were produced in 1...,"[Answer]: SELECT production_year, COUNT(*) FRO...",1

In [23]:
df['text'] = df['Schema'] + " " + df['questions'] + " " + df['answer']

In [24]:
df.head()

,Schema,questions,answer,field5,text
0,"[Schema]: Person(id, first_name, last_name, ye...",[Question]: How many writers were born in 1935?,[Answer]: SELECT SUM(first_name)\r\nFROM perso...,0,"[Schema]: Person(id, first_name, last_name, ye..."
1,"[Schema]: Person(id, first_name, last_name, ye...",[Question]: How many writers were born in 1935?,[Answer]: SELECT COUNT(*) FROM (SELECT DISTINC...,1,"[Schema]: Person(id, first_name, last_name, ye..."
2,"[Schema]: Person(id, first_name, last_name, ye...",[Question]: How many writers were born in 1935?,[Answer]: SELECT COUNT(*) FROM (SELECT DISTINC...,1,"[Schema]: Person(id, first_name, last_name, ye..."
3,"[Schema]: Person(id, first_name, last_name, ye...",[Question]: How many writers were born in 1935?,[Answer]: SELECT COUNT(*) FROM (SELECT person....,0,"[Schema]: Person(id, first_name, last_name, ye..."
4,"[Schema]: Movie(title, production_year, countr...",[Question]: How many movies were produced in 1...,"[Answer]: SELECT production_year, COUNT(*) FRO...",1,"[Schema]: Movie(title, production_year, countr..."

In [25]:
df = df.drop(['Schema', 'questions', 'answer'], axis=1)

In [26]:
df.head()

   field5                                               text
0       0  [Schema]: Person(id, first_name, last_name, ye...
1       1  [Schema]: Person(id, first_name, last_name, ye...
2       1  [Schema]: Person(id, first_name, last_name, ye...
3       0  [Schema]: Person(id, first_name, last_name, ye...
4       1  [Schema]: Movie(title, production_year, countr...

In [27]:
df = df.loc[:,['text', 'field5']]

In [28]:
df = df.rename({'field5': 'label'}, axis=1)

In [29]:
df.head()

                                                text  label
0  [Schema]: Person(id, first_name, last_name, ye...      0
1  [Schema]: Person(id, first_name, last_name, ye...      1
2  [Schema]: Person(id, first_name, last_name, ye...      1
3  [Schema]: Person(id, first_name, last_name, ye...      0
4  [Schema]: Movie(title, production_year, countr...      1

In [30]:
df['text'][0]

'[Schema]: Person(id, first_name, last_name, year_born) primary key : {id};\nWriter(id, title, production_year, credits) primary key : {id, title, production_year} foreign keys : [title, production_year] _ Movie[title, production_year], [id] _ Person[id] [Question]: How many writers were born in 1935? [Answer]: SELECT SUM(first_name)\r\nFROM person \r\nWHERE year_born == 1935;'

In [31]:
df['text_length'] = df['text'].apply(len)

In [32]:
df

                                                    text  label  text_length
0      [Schema]: Person(id, first_name, last_name, ye...      0          373
1      [Schema]: Person(id, first_name, last_name, ye...      1          432
2      [Schema]: Person(id, first_name, last_name, ye...      1          432
3      [Schema]: Person(id, first_name, last_name, ye...      0          423
4      [Schema]: Movie(title, production_year, countr...      1          380
...                                                  ...    ...          ...
12894  [Schema]: Movie(title, production_year, countr...      1         2294
12895  [Schema]: Person(id, first_name, last_name, ye...      0          328
12896  [Schema]: Person(id, first_name, last_name, ye...      1          477
12897  [Schema]: Person(id, first_name, last_name, ye...      1          838
12898  [Schema]: Director Award(title, production_yea...      0          672

[12899 rows x 3 columns]

In [33]:
df['text_length'].describe()

count    12899.000000
mean       747.615939
std        428.317409
min        195.000000
25%        421.000000
50%        686.000000
75%        949.000000
max       3059.000000
Name: text_length, dtype: float64

In [34]:
df = df[df['text_length'] <= 512]

In [35]:
df

                                                    text  label  text_length
0      [Schema]: Person(id, first_name, last_name, ye...      0          373
1      [Schema]: Person(id, first_name, last_name, ye...      1          432
2      [Schema]: Person(id, first_name, last_name, ye...      1          432
3      [Schema]: Person(id, first_name, last_name, ye...      0          423
4      [Schema]: Movie(title, production_year, countr...      1          380
...                                                  ...    ...          ...
12888  [Schema]: Movie(title, production_year, countr...      1          384
12889  [Schema]: Movie(title, production_year, countr...      1          384
12890  [Schema]: Person(id, first_name, last_name, ye...      0          391
12895  [Schema]: Person(id, first_name, last_name, ye...      0          328
12896  [Schema]: Person(id, first_name, last_name, ye...      1          477

[5181 rows x 3 columns]

# training

In [36]:
import numpy as np
import pandas as pd
from datasets import Dataset
from transformers import TrainingArguments
from transformers import Trainer

In [37]:
ds = Dataset.from_pandas(df)

In [38]:
ds

Dataset({
    features: ['text', 'label', 'text_length', '__index_level_0__'],
    num_rows: 5181
})

In [39]:
ds = ds.train_test_split(test_size=0.2)
ds

DatasetDict({
    train: Dataset({
        features: ['text', 'label', 'text_length', '__index_level_0__'],
        num_rows: 4144
    })
    test: Dataset({
        features: ['text', 'label', 'text_length', '__index_level_0__'],
        num_rows: 1037
    })
})

In [40]:
from transformers import AutoTokenizer
tokenizer = AutoTokenizer.from_pretrained("bert-base-uncased")

In [41]:
def tokenize(batch):
    return tokenizer(batch['text'], truncation=True)

In [42]:
tokenized_ds = ds.map(tokenize, batched=True)
tokenized_ds

Map:   0%|          | 0/4144 [00:00<?, ? examples/s]

Map:   0%|          | 0/1037 [00:00<?, ? examples/s]

DatasetDict({
    train: Dataset({
        features: ['text', 'label', 'text_length', '__index_level_0__', 'input_ids', 'token_type_ids', 'attention_mask'],
        num_rows: 4144
    })
    test: Dataset({
        features: ['text', 'label', 'text_length', '__index_level_0__', 'input_ids', 'token_type_ids', 'attention_mask'],
        num_rows: 1037
    })
})

In [43]:
from transformers import DataCollatorWithPadding

data_collator = DataCollatorWithPadding(tokenizer)

In [44]:
import evaluate

accuracy = evaluate.load("accuracy")

def compute_metrics(eval_pred):
    predictions, labels = eval_pred
    predictions = np.argmax(predictions, axis=1)
    return accuracy.compute(predictions=predictions, references=labels)

In [45]:
id2label = {0: "negative", 1: "positive"}  
label2id = {"negative": 0, "positive": 1}

In [46]:
from transformers import AutoModelForSequenceClassification

model = AutoModelForSequenceClassification.from_pretrained(
    "bert-base-uncased", num_labels=2, id2label=id2label, label2id=label2id
)

Some weights of BertForSequenceClassification were not initialized from the model checkpoint at bert-base-uncased and are newly initialized: ['classifier.bias', 'classifier.weight']
You should probably TRAIN this model on a down-stream task to be able to use it for predictions and inference.

In [47]:
from transformers import TrainingArguments

finetuned_model_name = 'PatWang/bert-base-uncased-finetuned-sql-classification-with_schema_question'
batch_size = 4

training_args = TrainingArguments(
    output_dir=finetuned_model_name,
    num_train_epochs=5,
    per_device_train_batch_size=batch_size,
    per_device_eval_batch_size=batch_size,
    evaluation_strategy='epoch',
    save_strategy='epoch'
)

In [48]:
from transformers import Trainer

trainer = Trainer(
    model,
    training_args,
    train_dataset=tokenized_ds['train'],
    eval_dataset=tokenized_ds['test'],
    tokenizer=tokenizer,
    compute_metrics=compute_metrics
)

In [49]:
# preds_output = trainer.predict(tokenized_ds['test'])
# preds_output.metrics

In [50]:
# trainer.train()

In [51]:
# from huggingface_hub import notebook_login

# notebook_login()

In [52]:
# trainer.push_to_hub()

In [53]:
ds['test']

Dataset({
    features: ['text', 'label', 'text_length', '__index_level_0__'],
    num_rows: 1037
})

In [55]:
ds['test']['text'][0]

'[Schema]: Person(id, first_name, last_name, year_born) primary key : {id} [Question]: Assume persons who were born in the same year are the same age and there is only one youngest person (with no ties/draws) in this database, who is/are the second youngest person(s) in the database? List the id(s) of the person(s). [Answer]: select id from person where year_born=(\r\nselect max(year_born) from person where year_born <> (select max(year_born) from person)\r\n);'

# Test result from different schemas

In [109]:
df = pd.read_json('sql_create_context_v4.json')

In [110]:
df.head()

,question,context,answer
0,How many heads of the departments are older th...,CREATE TABLE head (age INTEGER),SELECT COUNT(*) FROM head WHERE age > 56
1,"List the name, born state and age of the heads...","CREATE TABLE head (name VARCHAR, born_state VA...","SELECT name, born_state, age FROM head ORDER B..."
2,"List the creation year, name and budget of eac...","CREATE TABLE department (creation VARCHAR, nam...","SELECT creation, name, budget_in_billions FROM..."
3,What are the maximum and minimum budget of the...,CREATE TABLE department (budget_in_billions IN...,"SELECT MAX(budget_in_billions), MIN(budget_in_..."
4,What is the average number of employees of the...,CREATE TABLE department (num_employees INTEGER...,SELECT AVG(num_employees) FROM department WHER...

In [111]:
def add_content(row):
    return "[Question]: " + str(row)

# Apply the function to the 'cleaned_preamble' column
df['question'] = df['question'].apply(add_content)

In [112]:
def add_content(row):
    return "[Question]: " + str(row)

# Apply the function to the 'cleaned_preamble' column
df['question'] = df['question'].apply(add_content)

In [113]:
length = {}
for i in range(1000):
    length[i] = len(df['context'][i])

In [114]:
max_key = max(length, key=length.get)
max_value = length[max_key]

In [115]:
max_key

734

In [116]:
max_value

292

In [117]:
length[734]

292

In [118]:
df['context'][734]

'CREATE TABLE stadium (name VARCHAR, average_attendance VARCHAR, total_attendance VARCHAR, id VARCHAR); CREATE TABLE stadium (name VARCHAR, average_attendance VARCHAR, total_attendance VARCHAR); CREATE TABLE game (stadium_id VARCHAR, id VARCHAR); CREATE TABLE injury_accident (game_id VARCHAR)'